# Gather Section (20 Questions, 40 Marks)

You should have access to a file called TMDB.db. The first step to answering this set of questions will be to connect to this db file to access the data.

![SQL Architectures](https://raw.githubusercontent.com/Explore-AI/Public-Data/master/image/TMDB_ERD.JPG)

Before we start we need to load our SQL magic commands (we only need do this once per notebook):

In [1]:
!pip install ipython-sql
!pip install pymysql
%load_ext sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (3.11.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.35)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.1)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (71.0.4)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Using cached jedi-0.19.1-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Using cached jedi-0.19.1-py2.py3-none-any.whl (1.6 MB)
Installing collected packages: jedi
Successfully installed jedi-0.19.1
Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 2.5 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1




Based on that data, answer the following questions:


### Question 1
What is the code you can use to connect to the TMDB database that is saved in a Colab notebook?

In [2]:
%%sql
sqlite:///TMDB.db

### Question 2
What is the primary key for the table “movies”?

In [ ]:
%%sql
PRAGMA table_info(movies);

 * sqlite:///TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

### Question 3
How many foreign keys does the “languagemap” table have?

In [ ]:
%%sql
PRAGMA foreign_key_list(languagemap);

 * sqlite:///TMDB.db
Done.

[(0, 0, 'movies', 'movie_id', 'movie_id', 'NO ACTION', 'NO ACTION', 'NONE'),
 (1, 0, 'languages', 'iso_639_1', 'iso_639_1', 'NO ACTION', 'NO ACTION', 'NONE')]

### Question 4
What code would you use to set up a view of all movies that did not get released?

In [ ]:
%%sql
CREATE VIEW unreleased_movies AS
SELECT *
FROM movies
WHERE release_status != 'Released';

 * sqlite:///TMDB.db
Done.

[]

### Question 5
How would you select only the title, release date, and release status columns from the view you created in the previous question?

In [ ]:
%%sql
SELECT title, release_date, release_status
FROM unreleased_movies;

 * sqlite:///TMDB.db
Done.

[('Little Big Top', '2006-01-01 00:00:00.000000', 'Rumored'),
 ('The Helix... Loaded', '2005-01-01 00:00:00.000000', 'Rumored'),
 ('Higher Ground', '2011-08-26 00:00:00.000000', 'Post Production'),
 ('Crying with Laughter', '2009-06-01 00:00:00.000000', 'Rumored'),
 ('The Harvest (La Cosecha)', '2011-07-29 00:00:00.000000', 'Rumored'),
 ('The Naked Ape', '2006-09-16 00:00:00.000000', 'Rumored'),
 ('Brotherly Love', '2015-04-24 00:00:00.000000', 'Post Production'),
 ("Dancin' It's On", '2015-10-16 00:00:00.000000', 'Post Production')]

### Question 6
How many movies are no longer using their original titles?

In [ ]:
%%sql
select count(*)
from movies
where original_title != title;

 * sqlite:///TMDB.db
Done.

[(261,)]

### Question 7
What is the most popular movie that was made after 01/01/2000 with a budget of more than $100 000 000? (Hint: Use the popularity field in the Movies table. Larger numbers are more popular.)

In [ ]:
%%sql
select title, popularity
from movies
where release_date > '2000-01-01' and budget > 100000000
order by popularity desc
limit 1;

 * sqlite:///TMDB.db
Done.

[('Interstellar', 724.247784)]

### Question 8
How many movies are there that do not have English as their original language?

In [ ]:
%%sql
select count(*)
from movies
where original_language != 'en';

 * sqlite:///TMDB.db
Done.

[(298,)]

### Question 9
In how many movies did Tom Cruise portray the character Ethan Hunt?

In [ ]:
%%sql
select count(*)
from Casts as c
INNER JOIN Actors as a
on c.actor_id = a.actor_id
where a.actor_name = 'Tom Cruise' and c.characters = 'Ethan Hunt';

 * sqlite:///TMDB.db
Done.

[(5,)]

### Question 10
How many times was the actress Cate Blanchett nominated for an Oscar?

In [ ]:
%%sql
select count(*)
from Oscars
where name like '%Cate Blanchett%';

 * sqlite:///TMDB.db
Done.

[(7,)]

### Question 11
What would be the code to insert a new genre called ‘Sport’ with an id of 10?

In [ ]:
%%sql
insert into Genres (genre_id, genre_name)
values (10, 'Sport');

 * sqlite:///TMDB.db
1 rows affected.

[]

### Question 12
You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [ ]:
%%sql
select movie_id
from movies
where title = 'The Flintstones';

 * sqlite:///TMDB.db
Done.

[(888,)]

In [ ]:
%%sql
select genre_id
from genres
where genre_name = 'Comedy';

 * sqlite:///TMDB.db
Done.

[(35,)]

In [ ]:
%%sql
Delete FROM GenreMap
WHERE movie_id = 888 AND genre_id = 35;

 * sqlite:///TMDB.db
1 rows affected.

[]

### Question 13
What code will give me the 10 most recently released movies in the database? and put it in a list

In [ ]:
%%sql
select title
from movies
order by release_date desc
limit 1;

 * sqlite:///TMDB.db
Done.

[('Growing Up Smith',)]

# **Making analysis on the data to get more insights of it**

In [ ]:
#Investehating information about movies
%%sql
select *
from movies
limit 5;

 * sqlite:///TMDB.db
Done.

[(5, 'Four Rooms', '1995-12-09 00:00:00.000000', 4000000, None, 'en', 'Four Rooms', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", 22.87623, 4300000.0, 98.0, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", 6.5, 530),
 (11, 'Star Wars', '1977-05-25 00:00:00.000000', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'en', 'Star Wars', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', 126.393695, 775398007.0, 121.0, 'Released', 'A long time ago in a galaxy far, far away...', 8.1, 6624),
 (12, 'Finding Nemo', '2003-05-30 00:00:00.000000', 94000000, 'http://movies.disney.com/finding-nemo', 'en', 'Finding Nemo', "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome ... (35 characters truncated) ... orgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.", 85.688789, 940335536.0, 100.0, 'Released', "There are 3.7 trillion fish in the ocean, they're looking for one.", 7.6, 6122),
 (13, 'Forrest Gump', '1994-07-06 00:00:00.000000', 55000000, None, 'en', 'Forrest Gump', "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what  ... (108 characters truncated) ... rest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.", 138.133331, 677945399.0, 142.0, 'Released', "The world will never be the same, once you've seen it through the eyes of Forrest Gump.", 8.2, 7927),
 (14, 'American Beauty', '1999-09-15 00:00:00.000000', 15000000, 'http://www.dreamworks.com/ab/', 'en', 'American Beauty', "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.", 80.878605, 356296601.0, 122.0, 'Released', 'Look closer.', 7.9, 3313)]

In [4]:
#investigating Oscars table
%%sql
select *
from Oscars
limit 10;

 * sqlite:///TMDB.db
Done.

[('1927/1928', 'Actor', None, 'Richard Barthelmess', 'The Noose'),
 ('1927/1928', 'Actor', '1.0', 'Emil Jannings', 'The Last Command'),
 ('1927/1928', 'Actress', None, 'Louise Dresser', 'A Ship Comes In'),
 ('1927/1928', 'Actress', '1.0', 'Janet Gaynor', '7th Heaven'),
 ('1927/1928', 'Actress', None, 'Gloria Swanson', 'Sadie Thompson'),
 ('1927/1928', 'Art Direction', None, 'Rochus Gliese', 'Sunrise'),
 ('1927/1928', 'Art Direction', '1.0', 'William Cameron Menzies', 'The Dove; Tempest'),
 ('1927/1928', 'Art Direction', None, 'Harry Oliver', '7th Heaven'),
 ('1927/1928', 'Cinematography', None, 'George Barnes', 'The Devil Dancer; The Magic Flame; Sadie Thompson'),
 ('1927/1928', 'Cinematography', '1.0', 'Charles Rosher', 'Sunrise')]

In [ ]:
#Showing top 10 rated moives
%%sql
select title As Film_Name, vote_average AS Rating
from movies
order by vote_average desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Little Big Top', 10.0),
 ('Dancer, Texas Pop. 81', 10.0),
 ('Stiff Upper Lips', 10.0),
 ('Me You and Five Bucks', 10.0),
 ('Sardaarji', 9.5),
 ("One Man's Hero", 9.3),
 ('The Shawshank Redemption', 8.5),
 ('There Goes My Baby', 8.5),
 ('The Godfather', 8.4),
 ('The Prisoner of Zenda', 8.4)]

In [ ]:
#The above query may not be very accurate as the number of votes also should be considered
%%sql
SELECT title As Film_Name, vote_average AS Rating
FROM movies
WHERE vote_count >= 1000
ORDER BY vote_average DESC
LIMIT 10;

 * sqlite:///TMDB.db
Done.

[('The Shawshank Redemption', 8.5),
 ('The Godfather', 8.4),
 ('Spirited Away', 8.3),
 ('The Godfather: Part II', 8.3),
 ("Schindler's List", 8.3),
 ('Fight Club', 8.3),
 ('Pulp Fiction', 8.3),
 ('Whiplash', 8.3),
 ('Forrest Gump', 8.2),
 ('American History X', 8.2)]

In [ ]:
# Showing the most popular moives
%%sql
select title As Film_Name, popularity popularity
from movies
order by popularity desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Minions', 875.581305),
 ('Interstellar', 724.247784),
 ('Deadpool', 514.569956),
 ('Guardians of the Galaxy', 481.098624),
 ('Mad Max: Fury Road', 434.278564),
 ('Jurassic World', 418.708552),
 ('Pirates of the Caribbean: The Curse of the Black Pearl', 271.972889),
 ('Dawn of the Planet of the Apes', 243.791743),
 ('The Hunger Games: Mockingjay - Part 1', 206.227151),
 ('Big Hero 6', 203.73459)]

In [5]:
# Showing Moives with the highest revenu
%%sql
select title As Film_Name, revenue AS Revenue
from movies
order by revenue desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Avatar', 2787965087.0),
 ('Titanic', 1845034188.0),
 ('The Avengers', 1519557910.0),
 ('Jurassic World', 1513528810.0),
 ('Furious 7', 1506249360.0),
 ('Avengers: Age of Ultron', 1405403694.0),
 ('Frozen', 1274219009.0),
 ('Iron Man 3', 1215439994.0),
 ('Minions', 1156730962.0),
 ('Captain America: Civil War', 1153304495.0)]

From the above three queries we can say that the there was no relation between a moive rating and it's popularity
and only one moive (Minions) appeared on both revenu and popularity

# Quering data based on original language

In [8]:
# Showing the distribution of movies by language.
%%sql
SELECT original_language AS Language , COUNT(*) AS movie_count
FROM movies
GROUP BY original_language
ORDER BY movie_count DESC
limit 10;

 * sqlite:///TMDB.db
Done.

[('en', 4505),
 ('fr', 70),
 ('es', 32),
 ('zh', 27),
 ('de', 27),
 ('hi', 19),
 ('ja', 16),
 ('it', 14),
 ('cn', 12),
 ('ru', 11)]

**We notice that most movies have the English language as there original languge. so, English would be the language that gets the most revenu and has more popular movies. but what if we took the average of revenu, rating and popularity per language**

In [ ]:
%%sql
select original_language as Languge , round((avg(revenue)/1000000),2) as avg_revenue, round(avg(vote_average),1) as avg_rating
, round(avg(popularity),2) as avg_popularity
from movies
group by original_language
order by avg_popularity desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('el', 0.11, 6.9, 28.86),
 ('ja', 66.03, 7.1, 25.66),
 ('id', 2.27, 7.4, 24.59),
 ('en', 86.48, 6.1, 22.18),
 ('ko', 25.36, 6.7, 19.49),
 ('it', 3.03, 7.0, 17.82),
 ('da', 29.9, 7.1, 17.66),
 ('te', 100.0, 7.5, 16.25),
 ('es', 18.65, 6.7, 13.33),
 ('pl', 10.7, 7.1, 13.27)]

In [9]:
%%sql
select *
from languages
where iso_639_1= "el"

 * sqlite:///TMDB.db
Done.

[('el', '????????')]

# Investigating data based on released date

In [10]:
#Retrieving movies based on their release year as inwhich country the most movies was released
%%sql
SELECT strftime('%Y',release_date) AS year, COUNT(*) as year_count
FROM movies
GROUP BY year
order by year_count desc
limit 10

 * sqlite:///TMDB.db
Done.

[('2009', 247),
 ('2014', 238),
 ('2006', 237),
 ('2013', 231),
 ('2008', 227),
 ('2010', 225),
 ('2011', 223),
 ('2005', 217),
 ('2015', 216),
 ('2012', 208)]

In [11]:
%%sql
SELECT strftime('%Y',release_date) AS year, COUNT(*) as year_count
FROM movies
GROUP BY year
order by year_count asc
limit 10

 * sqlite:///TMDB.db
Done.

[(None, 1),
 ('1916', 1),
 ('1925', 1),
 ('1927', 1),
 ('1930', 1),
 ('1932', 1),
 ('1934', 1),
 ('1935', 1),
 ('1941', 1),
 ('1950', 1)]

we found out that 2009 was the year with the most movies
releases **but was 2009 had the hightest revenue??**

In [ ]:
# in which year movies made the highest revenue
%%sql
SELECT strftime('%Y',release_date) AS year, round((sum(revenue))/1000000) as year_revenue
FROM movies
GROUP BY year
order by year_revenue desc
limit 10

 * sqlite:///TMDB.db
Done.

[('2012', 24142.0),
 ('2014', 24120.0),
 ('2013', 23411.0),
 ('2015', 22775.0),
 ('2009', 21073.0),
 ('2011', 20517.0),
 ('2010', 20349.0),
 ('2008', 18146.0),
 ('2006', 16636.0),
 ('2007', 16492.0)]

So, 2012 was the year which had the highest total revenue and 2009 came in the fifth place

# Genre analysing

In [ ]:
# showing movie genre with the most movies
%%sql
select genre_name, count(*) as movie_count
from movies M, (select movie_id, genre_name
from Genremap GM , Genres G
where GM.genre_id = G.genre_id) as MG
on M.movie_id = MG.movie_id
group by genre_name
order by movie_count desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Drama', 2297),
 ('Comedy', 1722),
 ('Thriller', 1274),
 ('Action', 1154),
 ('Romance', 894),
 ('Adventure', 790),
 ('Crime', 696),
 ('Science Fiction', 535),
 ('Horror', 519),
 ('Family', 513)]

In [ ]:
# showing movie genre which gets the most revenu and has the hisghest rating
%%sql
select genre_name, round((SUM(revenue)/1000000),2) as total_revenue_Per_M, round(AVG(vote_average),1) as avg_rating,
round(AVG(popularity),1) as avg_popularity
from movies M, (select movie_id, genre_name
from Genremap GM , Genres G
where GM.genre_id = G.genre_id) as MG
on M.movie_id = MG.movie_id
group by genre_name
order by total_revenue_Per_M desc, avg_rating
limit 10

 * sqlite:///TMDB.db
Done.

[('Adventure', 164841.56, 6.2, 39.3),
 ('Action', 162959.91, 6.0, 30.9),
 ('Comedy', 122418.89, 5.9, 18.2),
 ('Drama', 119710.98, 6.4, 17.8),
 ('Thriller', 103250.43, 6.0, 24.5),
 ('Family', 83283.24, 6.0, 27.8),
 ('Fantasy', 81982.2, 6.1, 36.4),
 ('Science Fiction', 81564.24, 6.0, 36.5),
 ('Romance', 53642.14, 6.2, 16.0),
 ('Animation', 52812.17, 6.3, 38.8)]

# Production companies

In [ ]:
# Investigating the data
%%sql
select *
from productionCompanies
limit 5;

 * sqlite:///TMDB.db
Done.

[(1, 'Lucasfilm'),
 (2, 'Walt Disney Pictures'),
 (3, 'Pixar Animation Studios'),
 (4, 'Paramount Pictures'),
 (5, 'Columbia Pictures')]

In [ ]:
# Showing top companies with the highest revenue
%%sql
select production_company_name, ROUND(sum(revenue/1000000),2) as total_revenue
from movies M,(select production_company_name,movie_id
from productionCompanies PC , productionCompanyMap PCM
where PC.production_company_id = PCM.production_company_id) as PCS
where M.movie_id = PCS.movie_id
group by production_company_name
order by revenue desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('QuTbec Production Services Tax Credit', 1506.25),
 ('Media Rights Capital (MRC)', 1723.27),
 ('Colorado Office of Film, Television & Media', 1506.25),
 ('Abu Dhabi Film Commission', 1506.25),
 ('Prime Focus', 1405.4),
 ('Vita-Ray Dutch Productions (III)', 1153.3),
 ('Deluxe Digital Studios', 1153.3),
 ('Indochina Productions', 1531.35),
 ('Ian Bryce Productions', 1091.41),
 ('China Movie Channel', 1773.74)]

In [13]:
%%sql
select *
from movies M,(select production_company_name,movie_id
from productionCompanies PC , productionCompanyMap PCM
where PC.production_company_id = PCM.production_company_id) as PCS
where M.movie_id = PCS.movie_id and production_company_name = "QuTbec Production Services Tax Credit"
group by production_company_name

 * sqlite:///TMDB.db
Done.

[(168259, 'Furious 7', '2015-04-01 00:00:00.000000', 190000000, 'http://www.furious7.com/', 'en', 'Furious 7', 'Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.', 102.322217, 1506249360.0, 137.0, 'Released', 'Vengeance Hits Home', 7.3, 4176, 'QuTbec Production Services Tax Credit', 168259)]

In [ ]:
# companies that invest more in the industry
%%sql
select production_company_name, count(*) as N_per_company
from movies M,(select production_company_name,movie_id
from productionCompanies PC , productionCompanyMap PCM
where PC.production_company_id = PCM.production_company_id) as PCS
where M.movie_id = PCS.movie_id
group by production_company_name
order by N_per_company  desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Warner Bros.', 319),
 ('Universal Pictures', 311),
 ('Paramount Pictures', 285),
 ('Twentieth Century Fox Film Corporation', 222),
 ('Columbia Pictures', 201),
 ('New Line Cinema', 165),
 ('Metro-Goldwyn-Mayer (MGM)', 122),
 ('Touchstone Pictures', 118),
 ('Walt Disney Pictures', 114),
 ('Relativity Media', 102)]

### Question 14
# Visualization with Python

You can choose **any table** from the database and create visualizations using Python libraries like **Matplotlib** or **Seaborn**. The goal is to explore and understand the data through visual analysis.

For example, you could create a **bar chart** to show the number of movies in each genre or a **scatter plot** to compare movie **budget vs. revenue**.

You can also **combine data from multiple tables** (using SQL joins) to create more complex visualizations. For instance, you might join the **Movies** table with the **Genres** table to show which genres have the highest-rated movies.



### Example Ideas:
- **Genres**: Visualize the most popular genres by the number of movies.
- **Budget vs Revenue**: Analyze the relationship between movie budget and revenue.
- **Languages**: Show the distribution of movies by language using a pie chart.
- **Movie Trends**: Visualize how the number of movie releases has changed over the years.